; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=333, out_folder=htg/blocksworld/training, instance_id=71, seed=2095, goal_proportion=0.03

(define (problem blocksworld-71)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 - object)
 (:init 
    (arm-empty)
    (clear b147)
    (on b147 b111)
    (on b111 b58)
    (on-table b58)
    (clear b67)
    (on b67 b225)
    (on b225 b323)
    (on b323 b228)
    (on b228 b21)
    (on-table b21)
    (clear b283)
    (on-table b283)
    (clear b267)
    (on b267 b221)
    (on b221 b308)
    (on b308 b220)
    (on b220 b195)
    (on b195 b118)
    (on b118 b171)
    (on b171 b279)
    (on b279 b55)
    (on-table b55)
    (clear b177)
    (on-table b177)
    (clear b307)
    (on b307 b7)
    (on-table b7)
    (clear b162)
    (on b162 b257)
    (on-table b257)
    (clear b93)
    (on-table b93)
    (clear b227)
    (on b227 b197)
    (on b197 b57)
    (on b57 b203)
    (on b203 b284)
    (on b284 b205)
    (on b205 b150)
    (on-table b150)
    (clear b299)
    (on b299 b269)
    (on-table b269)
    (clear b114)
    (on-table b114)
    (clear b127)
    (on b127 b41)
    (on-table b41)
    (clear b14)
    (on b14 b180)
    (on b180 b173)
    (on b173 b218)
    (on b218 b52)
    (on b52 b159)
    (on b159 b69)
    (on b69 b43)
    (on b43 b131)
    (on-table b131)
    (clear b319)
    (on b319 b36)
    (on-table b36)
    (clear b83)
    (on-table b83)
    (clear b208)
    (on b208 b56)
    (on b56 b154)
    (on b154 b226)
    (on-table b226)
    (clear b181)
    (on b181 b51)
    (on b51 b157)
    (on b157 b18)
    (on b18 b212)
    (on-table b212)
    (clear b59)
    (on b59 b309)
    (on-table b309)
    (clear b42)
    (on b42 b217)
    (on b217 b11)
    (on-table b11)
    (clear b302)
    (on-table b302)
    (clear b105)
    (on b105 b265)
    (on-table b265)
    (clear b256)
    (on b256 b188)
    (on b188 b107)
    (on-table b107)
    (clear b183)
    (on-table b183)
    (clear b291)
    (on b291 b223)
    (on b223 b268)
    (on b268 b329)
    (on b329 b23)
    (on b23 b73)
    (on-table b73)
    (clear b120)
    (on b120 b20)
    (on b20 b116)
    (on b116 b242)
    (on-table b242)
    (clear b50)
    (on b50 b99)
    (on-table b99)
    (clear b140)
    (on b140 b286)
    (on b286 b138)
    (on b138 b185)
    (on b185 b311)
    (on-table b311)
    (clear b130)
    (on b130 b71)
    (on b71 b54)
    (on-table b54)
    (clear b187)
    (on b187 b293)
    (on b293 b303)
    (on b303 b176)
    (on-table b176)
    (clear b123)
    (on b123 b332)
    (on-table b332)
    (clear b125)
    (on b125 b290)
    (on b290 b4)
    (on b4 b80)
    (on b80 b133)
    (on b133 b144)
    (on b144 b84)
    (on-table b84)
    (clear b202)
    (on b202 b229)
    (on b229 b210)
    (on b210 b198)
    (on b198 b235)
    (on b235 b248)
    (on b248 b5)
    (on-table b5)
    (clear b289)
    (on-table b289)
    (clear b61)
    (on b61 b100)
    (on b100 b219)
    (on b219 b10)
    (on-table b10)
    (clear b327)
    (on b327 b155)
    (on b155 b22)
    (on-table b22)
    (clear b306)
    (on-table b306)
    (clear b196)
    (on b196 b246)
    (on b246 b106)
    (on b106 b310)
    (on-table b310)
    (clear b304)
    (on b304 b298)
    (on-table b298)
    (clear b251)
    (on b251 b163)
    (on-table b163)
    (clear b281)
    (on b281 b292)
    (on b292 b108)
    (on b108 b207)
    (on b207 b179)
    (on-table b179)
    (clear b27)
    (on b27 b271)
    (on-table b271)
    (clear b119)
    (on b119 b44)
    (on b44 b102)
    (on b102 b134)
    (on-table b134)
    (clear b68)
    (on-table b68)
    (clear b3)
    (on b3 b318)
    (on-table b318)
    (clear b139)
    (on b139 b31)
    (on b31 b88)
    (on-table b88)
    (clear b264)
    (on b264 b87)
    (on b87 b255)
    (on b255 b89)
    (on b89 b38)
    (on b38 b209)
    (on-table b209)
    (clear b75)
    (on b75 b8)
    (on b8 b145)
    (on b145 b149)
    (on b149 b172)
    (on b172 b25)
    (on-table b25)
    (clear b200)
    (on b200 b6)
    (on-table b6)
    (clear b280)
    (on b280 b169)
    (on b169 b161)
    (on-table b161)
    (clear b40)
    (on-table b40)
    (clear b236)
    (on-table b236)
    (clear b137)
    (on b137 b266)
    (on b266 b199)
    (on b199 b294)
    (on b294 b239)
    (on-table b239)
    (clear b165)
    (on b165 b322)
    (on b322 b321)
    (on b321 b240)
    (on b240 b215)
    (on-table b215)
    (clear b86)
    (on b86 b53)
    (on-table b53)
    (clear b46)
    (on b46 b282)
    (on b282 b164)
    (on b164 b160)
    (on b160 b95)
    (on-table b95)
    (clear b9)
    (on b9 b90)
    (on b90 b216)
    (on-table b216)
    (clear b170)
    (on-table b170)
    (clear b66)
    (on b66 b295)
    (on-table b295)
    (clear b81)
    (on b81 b243)
    (on-table b243)
    (clear b276)
    (on b276 b258)
    (on-table b258)
    (clear b296)
    (on-table b296)
    (clear b192)
    (on b192 b186)
    (on-table b186)
    (clear b62)
    (on-table b62)
    (clear b32)
    (on b32 b76)
    (on b76 b232)
    (on b232 b112)
    (on b112 b260)
    (on b260 b326)
    (on-table b326)
    (clear b101)
    (on b101 b316)
    (on-table b316)
    (clear b63)
    (on b63 b103)
    (on b103 b230)
    (on b230 b92)
    (on b92 b47)
    (on b47 b78)
    (on b78 b175)
    (on b175 b233)
    (on b233 b234)
    (on b234 b274)
    (on b274 b85)
    (on b85 b2)
    (on b2 b124)
    (on b124 b249)
    (on b249 b65)
    (on-table b65)
    (clear b261)
    (on b261 b314)
    (on b314 b285)
    (on b285 b94)
    (on b94 b34)
    (on-table b34)
    (clear b189)
    (on-table b189)
    (clear b113)
    (on b113 b146)
    (on b146 b312)
    (on b312 b313)
    (on b313 b315)
    (on b315 b330)
    (on b330 b277)
    (on b277 b49)
    (on b49 b48)
    (on b48 b136)
    (on-table b136)
    (clear b28)
    (on-table b28)
    (clear b253)
    (on-table b253)
    (clear b104)
    (on-table b104)
    (clear b178)
    (on b178 b250)
    (on-table b250)
    (clear b19)
    (on b19 b328)
    (on-table b328)
    (clear b263)
    (on b263 b91)
    (on b91 b331)
    (on b331 b1)
    (on b1 b201)
    (on b201 b211)
    (on b211 b77)
    (on-table b77)
    (clear b16)
    (on b16 b275)
    (on b275 b29)
    (on b29 b206)
    (on b206 b109)
    (on b109 b204)
    (on b204 b191)
    (on-table b191)
    (clear b213)
    (on b213 b317)
    (on-table b317)
    (clear b270)
    (on b270 b117)
    (on b117 b222)
    (on b222 b12)
    (on b12 b98)
    (on b98 b273)
    (on b273 b278)
    (on b278 b247)
    (on-table b247)
    (clear b148)
    (on b148 b325)
    (on-table b325)
    (clear b193)
    (on b193 b37)
    (on b37 b158)
    (on-table b158)
    (clear b141)
    (on b141 b262)
    (on b262 b237)
    (on b237 b39)
    (on b39 b168)
    (on-table b168)
    (clear b60)
    (on b60 b82)
    (on b82 b143)
    (on b143 b33)
    (on b33 b122)
    (on b122 b26)
    (on b26 b174)
    (on b174 b245)
    (on b245 b30)
    (on-table b30)
    (clear b45)
    (on-table b45)
    (clear b17)
    (on b17 b152)
    (on b152 b194)
    (on b194 b79)
    (on-table b79)
    (clear b129)
    (on b129 b97)
    (on-table b97)
    (clear b70)
    (on-table b70)
    (clear b297)
    (on b297 b72)
    (on b72 b15)
    (on b15 b254)
    (on-table b254)
    (clear b13)
    (on b13 b74)
    (on b74 b272)
    (on-table b272)
    (clear b305)
    (on b305 b151)
    (on b151 b324)
    (on b324 b156)
    (on b156 b190)
    (on b190 b224)
    (on b224 b24)
    (on b24 b182)
    (on b182 b35)
    (on b35 b132)
    (on b132 b135)
    (on b135 b288)
    (on b288 b167)
    (on b167 b126)
    (on b126 b115)
    (on-table b115)
    (clear b121)
    (on b121 b241)
    (on-table b241)
    (clear b320)
    (on-table b320)
    (clear b128)
    (on-table b128)
    (clear b300)
    (on-table b300)
    (clear b231)
    (on b231 b214)
    (on b214 b238)
    (on b238 b259)
    (on b259 b244)
    (on b244 b153)
    (on b153 b301)
    (on-table b301)
    (clear b166)
    (on b166 b333)
    (on b333 b184)
    (on-table b184)
    (clear b64)
    (on b64 b110)
    (on b110 b96)
    (on b96 b252)
    (on b252 b142)
    (on b142 b287)
    (on-table b287))
 (:goal  (and 
    (clear b9)
    (on b9 b6)
    (on b6 b5)
    (on b5 b4)
    (on-table b4)
    (clear b7)
    (on b7 b2)
    (on b2 b8)
    (on b8 b1)
    (on b1 b3)
    (on-table b3))))

; plan
1. (unstack b3 b318)
   deleted: (on b3 b318) (clear b3) (arm-empty)
   added: (holding b3) (clear b318)
   goals met: 1 of 11
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 11
3. (unstack b125 b290)
   deleted: (on b125 b290) (clear b125) (arm-empty)
   added: (holding b125) (clear b290)
   goals met: 2 of 11
4. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 2 of 11
5. (unstack b200 b6)
   deleted: (on b200 b6) (clear b200) (arm-empty)
   added: (holding b200) (clear b6)
   goals met: 2 of 11
6. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 2 of 11
7. (unstack b202 b229)
   deleted: (on b202 b229) (clear b202) (arm-empty)
   added: (holding b202) (clear b229)
   goals met: 2 of 11
8. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 2 of 11
9. (unstack b229 b210)
   deleted: (on b229 b210) (clear b229) (arm-empty)
   added: (holding b229) (clear b210)
   goals met: 2 of 11
10. (putdown b229)
   deleted: (holding b229)
   added: (clear b229) (arm-empty) (on-table b229)
   goals met: 2 of 11
11. (unstack b210 b198)
   deleted: (on b210 b198) (clear b210) (arm-empty)
   added: (holding b210) (clear b198)
   goals met: 2 of 11
12. (putdown b210)
   deleted: (holding b210)
   added: (clear b210) (arm-empty) (on-table b210)
   goals met: 2 of 11
13. (unstack b198 b235)
   deleted: (on b198 b235) (clear b198) (arm-empty)
   added: (holding b198) (clear b235)
   goals met: 2 of 11
14. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 2 of 11
15. (unstack b235 b248)
   deleted: (on b235 b248) (clear b235) (arm-empty)
   added: (holding b235) (clear b248)
   goals met: 2 of 11
16. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 2 of 11
17. (unstack b248 b5)
   deleted: (on b248 b5) (clear b248) (arm-empty)
   added: (holding b248) (clear b5)
   goals met: 2 of 11
18. (putdown b248)
   deleted: (holding b248)
   added: (clear b248) (arm-empty) (on-table b248)
   goals met: 2 of 11
19. (unstack b263 b91)
   deleted: (on b263 b91) (clear b263) (arm-empty)
   added: (holding b263) (clear b91)
   goals met: 2 of 11
20. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 2 of 11
21. (unstack b290 b4)
   deleted: (on b290 b4) (clear b290) (arm-empty)
   added: (holding b290) (clear b4)
   goals met: 2 of 11
22. (putdown b290)
   deleted: (holding b290)
   added: (clear b290) (arm-empty) (on-table b290)
   goals met: 2 of 11
23. (unstack b4 b80)
   deleted: (on b4 b80) (clear b4) (arm-empty)
   added: (holding b4) (clear b80)
   goals met: 2 of 11
24. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 11
25. (unstack b307 b7)
   deleted: (on b307 b7) (clear b307) (arm-empty)
   added: (holding b307) (clear b7)
   goals met: 4 of 11
26. (putdown b307)
   deleted: (holding b307)
   added: (clear b307) (arm-empty) (on-table b307)
   goals met: 4 of 11
27. (unstack b63 b103)
   deleted: (on b63 b103) (clear b63) (arm-empty)
   added: (holding b63) (clear b103)
   goals met: 4 of 11
28. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 4 of 11
29. (unstack b103 b230)
   deleted: (on b103 b230) (clear b103) (arm-empty)
   added: (holding b103) (clear b230)
   goals met: 4 of 11
30. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 4 of 11
31. (unstack b230 b92)
   deleted: (on b230 b92) (clear b230) (arm-empty)
   added: (holding b230) (clear b92)
   goals met: 4 of 11
32. (putdown b230)
   deleted: (holding b230)
   added: (clear b230) (arm-empty) (on-table b230)
   goals met: 4 of 11
33. (unstack b75 b8)
   deleted: (on b75 b8) (clear b75) (arm-empty)
   added: (holding b75) (clear b8)
   goals met: 4 of 11
34. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 11
35. (unstack b91 b331)
   deleted: (on b91 b331) (clear b91) (arm-empty)
   added: (holding b91) (clear b331)
   goals met: 4 of 11
36. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 4 of 11
37. (unstack b331 b1)
   deleted: (on b331 b1) (clear b331) (arm-empty)
   added: (holding b331) (clear b1)
   goals met: 4 of 11
38. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 4 of 11
39. (unstack b92 b47)
   deleted: (on b92 b47) (clear b92) (arm-empty)
   added: (holding b92) (clear b47)
   goals met: 4 of 11
40. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 4 of 11
41. (unstack b47 b78)
   deleted: (on b47 b78) (clear b47) (arm-empty)
   added: (holding b47) (clear b78)
   goals met: 4 of 11
42. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 4 of 11
43. (unstack b78 b175)
   deleted: (on b78 b175) (clear b78) (arm-empty)
   added: (holding b78) (clear b175)
   goals met: 4 of 11
44. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 4 of 11
45. (unstack b175 b233)
   deleted: (on b175 b233) (clear b175) (arm-empty)
   added: (holding b175) (clear b233)
   goals met: 4 of 11
46. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 4 of 11
47. (unstack b233 b234)
   deleted: (on b233 b234) (clear b233) (arm-empty)
   added: (holding b233) (clear b234)
   goals met: 4 of 11
48. (putdown b233)
   deleted: (holding b233)
   added: (clear b233) (arm-empty) (on-table b233)
   goals met: 4 of 11
49. (unstack b234 b274)
   deleted: (on b234 b274) (clear b234) (arm-empty)
   added: (holding b234) (clear b274)
   goals met: 4 of 11
50. (putdown b234)
   deleted: (holding b234)
   added: (clear b234) (arm-empty) (on-table b234)
   goals met: 4 of 11
51. (unstack b274 b85)
   deleted: (on b274 b85) (clear b274) (arm-empty)
   added: (holding b274) (clear b85)
   goals met: 4 of 11
52. (putdown b274)
   deleted: (holding b274)
   added: (clear b274) (arm-empty) (on-table b274)
   goals met: 4 of 11
53. (unstack b85 b2)
   deleted: (on b85 b2) (clear b85) (arm-empty)
   added: (holding b85) (clear b2)
   goals met: 4 of 11
54. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 4 of 11
55. (unstack b1 b201)
   deleted: (on b1 b201) (clear b1) (arm-empty)
   added: (holding b1) (clear b201)
   goals met: 4 of 11
56. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 5 of 11
57. (unstack b2 b124)
   deleted: (on b2 b124) (clear b2) (arm-empty)
   added: (holding b2) (clear b124)
   goals met: 5 of 11
58. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 6 of 11
59. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 11
60. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 11
61. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 11
62. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 8 of 11
63. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 11
64. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 9 of 11
65. (unstack b9 b90)
   deleted: (on b9 b90) (clear b9) (arm-empty)
   added: (holding b9) (clear b90)
   goals met: 8 of 11
66. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 10 of 11
67. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 8 of 11
68. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 9 of 11
69. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 8 of 11
70. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 8 of 11
71. (unstack b8 b145)
   deleted: (on b8 b145) (clear b8) (arm-empty)
   added: (holding b8) (clear b145)
   goals met: 8 of 11
72. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 9 of 11
73. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 11
74. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 10 of 11
75. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 11
76. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 11 of 11
